null/xdslog/sentMessages/2015/5/16/sent_ProvideAndRegisterDocumentSet-b_null#896484c6-653e-424f-816f-2d072c27844b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
<S:Header>
<To xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">http://iol.test.ohie.org:5001/xdsrepository</To>
<Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</Action>
<ReplyTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo>
<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:896484c6-653e-424f-816f-2d072c27844b</MessageID>
</S:Header>
<S:Body>
<ns4:ProvideAndRegisterDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
<ns3:SubmitObjectsRequest>
<RegistryObjectList>
<ExtrinsicObject id="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
<Slot name="creationTime">
<ValueList>
<Value>20150504</Value>
</ValueList>
</Slot>
<Slot name="languageCode">
<ValueList>
<Value>en-us</Value>
</ValueList>
</Slot>
<Slot name="serviceStartTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="serviceStopTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientId">
<ValueList>
<Value>5132894987946830603^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientInfo">
<ValueList>
<Value>PID-3|5132894987946830603^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
<Value>PID-5|Heyworth^Rita</Value>
<Value>PID-7|19910606</Value>
<Value>PID-8|F</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Immunization History"/>
</Name>
<Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" id="urn:uuid:19830f7a-8633-46c6-aa52-3c921d3e7b64" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>8812399^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Dr. Family's Family Health Practice</Value>
</ValueList>
</Slot>
<Slot name="authorRole">
<ValueList>
<Value>Attending</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" id="urn:uuid:e17fb7b0-84ab-4e26-9960-e0f2668b0662" nodeRepresentation="Outpatient Care">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon practiceSettingCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Outpatient Care"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" id="urn:uuid:035e0429-a5ad-4e5d-8415-d196836013e8" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" id="urn:uuid:c33779fb-2fe1-440f-ba26-3e45400c0933" nodeRepresentation="1.3.6.1.4.1.21367.2006.7.101">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon confidentialityCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Normal"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" id="urn:uuid:d61cd8fd-fb62-4ee8-86a0-81d31d5e007b" nodeRepresentation="urn:ihe:pcc:aps:2007">
<Slot name="codingScheme">
<ValueList>
<Value>1.3.6.1.4.1.19376.1.2.3</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="urn:ihe:pcc:aps:2007"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" id="urn:uuid:92e19bcc-1e0e-4949-89be-cd7348fa1dd1" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" id="urn:uuid:7a2da260-d238-4903-9003-c4ec611a880a" nodeRepresentation="PC">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.5.11</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Primary Care Clinic"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:610c4d3d-c995-4d75-b752-a210661419d2" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" registryObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" value="5132894987946830603^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSDocumentEntry.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:51166733-df10-4521-ab2b-17f15e6e5bb8" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" registryObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883" value="2.16.840.1.113883.3.72.5.9.1.0.5386503746739456432111111111">
<Name>
<LocalizedString value="XDSDocumentEntry.uniqueId"/>
</Name>
</ExternalIdentifier>
</ExtrinsicObject>
<ExtrinsicObject id="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
<Slot name="creationTime">
<ValueList>
<Value>20150504</Value>
</ValueList>
</Slot>
<Slot name="languageCode">
<ValueList>
<Value>en-us</Value>
</ValueList>
</Slot>
<Slot name="serviceStartTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="serviceStopTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientId">
<ValueList>
<Value>5132894987946830603^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientInfo">
<ValueList>
<Value>PID-3|5132894987946830603^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
<Value>PID-5|Heyworth^Rita</Value>
<Value>PID-7|19910606</Value>
<Value>PID-8|F</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Immunization History"/>
</Name>
<Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" id="urn:uuid:7709d33e-bfe4-4412-9088-8927d83f00da" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>8812399^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Dr. Family's Family Health Practice</Value>
</ValueList>
</Slot>
<Slot name="authorRole">
<ValueList>
<Value>Attending</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" id="urn:uuid:0245f9cb-27c5-4246-a587-40f079f3871a" nodeRepresentation="Outpatient Care">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon practiceSettingCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Outpatient Care"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" id="urn:uuid:05758871-690b-4500-8580-8bbd32e494ac" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" id="urn:uuid:808f2e2e-b83c-41a4-a9ab-3f001b0c3e30" nodeRepresentation="1.3.6.1.4.1.21367.2006.7.101">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon confidentialityCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Normal"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" id="urn:uuid:ed3314f3-1eee-468f-b40f-432ce27339ae" nodeRepresentation="urn:ihe:pcc:aps:2007">
<Slot name="codingScheme">
<ValueList>
<Value>1.3.6.1.4.1.19376.1.2.3</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="urn:ihe:pcc:aps:2007"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" id="urn:uuid:a3b6d622-823f-4521-b9e7-b8dcd478c523" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" id="urn:uuid:a496d993-0baf-44fa-b734-944cd755f02e" nodeRepresentation="PC">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.5.11</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Primary Care Clinic"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:cbc45a34-ab96-4ed0-ad23-6550626172b5" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" registryObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" value="5132894987946830603^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSDocumentEntry.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:d8e7c9d6-23ef-4fd6-91f3-f48011ecc0ee" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" registryObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e" value="2.16.840.1.113883.3.72.5.9.1.0.5386503746149395552111111111">
<Name>
<LocalizedString value="XDSDocumentEntry.uniqueId"/>
</Name>
</ExternalIdentifier>
</ExtrinsicObject>
<RegistryPackage id="urn:uuid:ac7b446d-2c79-4ef8-9ef5-bdf49e0c465f">
<Slot name="submissionTime">
<ValueList>
<Value>20150504110603</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="SMS Gateway Package"/>
</Name>
<Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="urn:uuid:ac7b446d-2c79-4ef8-9ef5-bdf49e0c465f" id="urn:uuid:149ed757-a5fc-47ab-9f27-7218171ddac8" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>8812399^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Dr. Family's Family Health Practice</Value>
</ValueList>
</Slot>
<Slot name="authorRole">
<ValueList>
<Value>Attending</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="urn:uuid:ac7b446d-2c79-4ef8-9ef5-bdf49e0c465f" id="urn:uuid:edf5986e-2338-4623-ae45-d3e65bc8d6bc" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:101f26a4-8181-4f7e-b6dd-3f6955dbdbff" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" registryObject="urn:uuid:ac7b446d-2c79-4ef8-9ef5-bdf49e0c465f" value="5132894987946830603^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSSubmissionSet.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:ddbb4a4d-5fa4-4456-858b-6cb54f91a664" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" registryObject="urn:uuid:ac7b446d-2c79-4ef8-9ef5-bdf49e0c465f" value="2.16.840.1.113883.3.72.5.9.1.1.5549314503862833029111111111">
<Name>
<LocalizedString value="XDSSubmissionSet.uniqueId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:14301599-fdf9-4d3e-a17d-9c69024a3955" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" registryObject="urn:uuid:ac7b446d-2c79-4ef8-9ef5-bdf49e0c465f" value="2.16.840.1.113883.3.72.5.9.1.2.5190328671848149170">
<Name>
<LocalizedString value="XDSSubmissionSet.sourceId"/>
</Name>
</ExternalIdentifier>
</RegistryPackage>
<Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="urn:uuid:e43a1bb6-781c-47e5-89a3-e07725d6b27e" id="urn:uuid:a5ed8fc9-6715-41b1-aa27-582444916586"/>
<Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="urn:uuid:c62f796f-3da8-41d3-aa10-86d42d796795" sourceObject="urn:uuid:ac7b446d-2c79-4ef8-9ef5-bdf49e0c465f" targetObject="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883">
<Slot name="SubmissionSetStatus">
<ValueList>
<Value>Original</Value>
</ValueList>
</Slot>
</Association>
<Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="urn:uuid:d8a3c2cb-3bf3-4cbb-a447-5b0982eb1596" sourceObject="urn:uuid:ac7b446d-2c79-4ef8-9ef5-bdf49e0c465f" targetObject="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e">
<Slot name="SubmissionSetStatus">
<ValueList>
<Value>Original</Value>
</ValueList>
</Slot>
</Association>
</RegistryObjectList>
</ns3:SubmitObjectsRequest>
<ns4:Document id="urn:uuid:ffe3a876-d569-4337-91be-16e04bc5a883">
<xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:27fc3745-d9bc-4024-a571-9db3e5ce7ab4"/>
</ns4:Document>
<ns4:Document id="urn:uuid:ba8a2894-3d9f-4cab-bddc-2bab73277d4e">
<xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:6a81e29c-311d-4718-8221-9c35637d4d78"/>
</ns4:Document>
</ns4:ProvideAndRegisterDocumentSetRequest>
</S:Body>
</S:Envelope>
